package ssTable

/* ssTable的元数据结构
索引是从数据区开始！
0 ─────────────────────────────────────────────────────────►
◄───────────────────────────
          dataLen          ◄──────────────────
                                indexLen     ◄──────────────┐
┌──────────────────────────┬─────────────────┬──────────────┤
│                          │                 │              │
│          数据区           │   稀疏索引区     │    元数据     │
│                          │                 │              │
└──────────────────────────┴─────────────────┴──────────────┘
*/

// 保存在磁盘文件的末尾
const MetaInfoDataByteSize = 5 * 8

type MetaInfo struct {
	// 版本号
	version int64
	// 数据区起始索引
	dataStart int64
	// 数据区长度
	dataLen int64
	// 索引区起始位置
	indexStart int64
	// 索引区长度
	indexLen int64
}
